wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_pmu.h
/* PMU analog voltage detector threshold definitions */
#define CTL0_VAVDVC(regval)             (BITS(17,18) & ((uint32_t)(regval) << 17U))
#define PMU_AVDT_0                      CTL0_VAVDVC(0)                      /*!< voltage threshold is 1.7V */
#define PMU_AVDT_1                      CTL0_VAVDVC(1)                      /*!< voltage threshold is 2.1V */
#define PMU_AVDT_2                      CTL0_VAVDVC(2)                      /*!< voltage threshold is 2.5V */
#define PMU_AVDT_3                      CTL0_VAVDVC(3)                      /*!< voltage threshold is 2.8V */

/* PMU over voltage detector threshold definitions */
#define CTL0_VOVDVC(regval)             (BITS(25,26) & ((uint32_t)(regval) << 25U))
#define PMU_OVDT_0                      CTL0_VOVDVC(0)                      /*!< V0.9V over voltage threshold is 0.9V */
#define PMU_OVDT_1                      CTL0_VOVDVC(1)                      /*!< V0.9V over voltage threshold is 1.0V */
#define PMU_OVDT_2                      CTL0_VOVDVC(2)                      /*!< V0.9V over voltage threshold is 1.1V */
#define PMU_OVDT_3                      CTL0_VOVDVC(3)                      /*!< V0.9V over voltage threshold is 1.2V */

/* PMU under voltage detector threshold definitions */
#define CTL0_VUVDVC(regval)             (BITS(27,28) & ((uint32_t)(regval) << 27U))
#define PMU_UVDT_0                      CTL0_VUVDVC(0)                      /*!< V0.9V under voltage threshold is 0.8V */
#define PMU_UVDT_1                      CTL0_VUVDVC(1)                      /*!< V0.9V under voltage threshold is 0.7V */
#define PMU_UVDT_2                      CTL0_VUVDVC(2)                      /*!< V0.9V under voltage threshold is 0.6V */

/* PMU sram mode */
#define CTL0_SRAM_MODE(regval)          (BITS(29,30) & ((uint32_t)(regval) << 29U))
#define PMU_DISABLE                     CTL0_SRAM_MODE(0)                   /*!< disable */
#define PMU_PRECHARGE                   CTL0_SRAM_MODE(1)                   /*!< select precharge */
#define PMU_RETENTION                   CTL0_SRAM_MODE(2)                   /*!< select retention */

/* PMU VBAT battery charging resistor selection */
#define CTL3_VCRSEL(regval)             (BIT(9) & ((uint32_t)(regval) << 9U))
#define PMU_VCRSEL_5K                   CTL3_VCRSEL(0)                      /*!< 5 kOhms resistor is selected for charging VBAT battery */
#define PMU_VCRSEL_1P5K                 CTL3_VCRSEL(1)                      /*!< 1.5 kOhms resistor is selected for charging VBAT battery */

/* PMU flag definitions */
#define PMU_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define PMU_REG_VAL(periph)             (REG32(PMU + ((uint32_t)(periph) >> 6U)))
#define PMU_BIT_POS(val)                ((uint32_t)(val) & 0x1FU)

#define PMU_CTL0_OFFSET                 (0x00000000U)                       /*!< PMU control register 0 offset */
#define PMU_CS_OFFSET                   (0x00000004U)                       /*!< PMU control and status register offset */
#define PMU_CTL1_OFFSET                 (0x00000008U)                       /*!< PMU control register 1 offset */
#define PMU_CTL2_OFFSET                 (0x0000000CU)                       /*!< PMU control register 2 offset */
#define PMU_CTL3_OFFSET                 (0x00000010U)                       /*!< PMU control register 3 offset */
#define PMU_PAR_OFFSET                  (0x00000018U)                       /*!< PMU parameter register offset */

#define PMU_FLAG_WAKEUP                 PMU_REGIDX_BIT(PMU_CS_OFFSET, 0)    /*!< wakeup flag */
#define PMU_FLAG_STANDBY                PMU_REGIDX_BIT(PMU_CS_OFFSET, 1)    /*!< standby flag */
#define PMU_FLAG_LVDF                   PMU_REGIDX_BIT(PMU_CS_OFFSET, 2)    /*!< low voltage detector status flag */
#define PMU_FLAG_UVDF                   PMU_REGIDX_BIT(PMU_CS_OFFSET, 3)    /*!< record the undervoltage reset of the V0.9V */
#define PMU_FLAG_VUVDF0                 PMU_REGIDX_BIT(PMU_CS_OFFSET, 5)    /*!< V0.9V under voltage detector flag bit */
#define PMU_FLAG_VOVDF1                 PMU_REGIDX_BIT(PMU_CS_OFFSET, 6)    /*!< V0.9V over voltage detector flag bit after digital filter */
#define PMU_FLAG_VUVDF1                 PMU_REGIDX_BIT(PMU_CS_OFFSET, 7)    /*!< V0.9V under voltage detector flag bit after digital filter */
#define PMU_FLAG_VAVDF                  PMU_REGIDX_BIT(PMU_CS_OFFSET, 16)   /*!< VDDA analog voltage detector voltage output on VDDA flag */
#define PMU_FLAG_VOVDF0                 PMU_REGIDX_BIT(PMU_CS_OFFSET, 20)   /*!< peripheral voltage on V0.9V detector flag */
#define PMU_FLAG_PRDYN                  PMU_REGIDX_BIT(PMU_CTL0_OFFSET, 31) /*!< the internal memory instance power supplies are stable after returning from retention mode */
#define PMU_FLAG_BKPVSRF                PMU_REGIDX_BIT(PMU_CTL1_OFFSET, 16) /*!< backup voltage stabilizer ready flag */
#define PMU_FLAG_VBATLF                 PMU_REGIDX_BIT(PMU_CTL1_OFFSET, 20) /*!< VBAT level monitoring versus low threshold */
#define PMU_FLAG_VBATHF                 PMU_REGIDX_BIT(PMU_CTL1_OFFSET, 21) /*!< VBAT level monitoring versus high threshold */
#define PMU_FLAG_TEMPLF                 PMU_REGIDX_BIT(PMU_CTL1_OFFSET, 22) /*!< temperature level monitoring versus low threshold */
#define PMU_FLAG_TEMPHF                 PMU_REGIDX_BIT(PMU_CTL1_OFFSET, 23) /*!< temperature level monitoring versus high threshold */
#define PMU_FLAG_RDYFALLF               PMU_REGIDX_BIT(PMU_CTL3_OFFSET, 6)  /*!< record the occurrence of undervoltage reset on VDD09DSI */
#define PMU_FLAG_MIPIHTF                PMU_REGIDX_BIT(PMU_CTL3_OFFSET, 20) /*!< MIPI power switch ack flag */
#define PMU_FLAG_USB33RF                PMU_REGIDX_BIT(PMU_CTL3_OFFSET, 26) /*!< USB supply ready flag bit */
#define PMU_FLAG_RDYF                   PMU_REGIDX_BIT(PMU_CTL3_OFFSET, 29) /*!< the MIPI_LDO output voltage ready signal */
#define PMU_FLAG_PKCAUHTF               PMU_REGIDX_BIT(PMU_CTL3_OFFSET, 30) /*!< PKCAU power switch ack flag */
#define PMU_FLAG_ESCHTF                 PMU_REGIDX_BIT(PMU_CTL3_OFFSET, 31) /*!< ESC power switch ack flag */

